{
"answersArray": [
    {"firstAnswer": "Работать над созданием приложений с виртуальной или дополненной реальностью", "secondAnswer": "Делать из макетов дизайнеров красивые и аккуратные сайты","sphere":["mob","front"]},
    {"firstAnswer": "Создавать в мобильном приложении плавные переходы и интересные анимации", "secondAnswer": "Придумывать новые и нетривиальные способы поиска ошибок","sphere":["mob","qa"] },
    {"firstAnswer": "Делать мобильное приложение удобным и комфортным для пользователя", "secondAnswer": "Делать важную, но малозаметную работу: оптимизировать, настраивать и обеспечивать надежность сайта","sphere":["mob","full"]},
    {"firstAnswer":"Программировать сайты так, чтобы на любых устройствах они отображались хорошо", "secondAnswer": "Искать ошибки и придумывать способы, как лучше их исправить","sphere":["front","qa"]},
    {"firstAnswer": "Быть специалистом, от внимания которого не ускользнет ни один сдвинутый пиксель", "secondAnswer":"Уметь делать всю работу целиком - от идеи и до последней строчки кода","sphere":["qa","full"]},
    {"firstAnswer": "Делать сайты удобными и понятными для пользователей", "secondAnswer": "Разносторонне продумывать логику и внутреннюю структуру будущей программы","sphere":["front","full"]},
    {"firstAnswer": "Активно использовать в программировании микрофон, камеру, геолокацию и др. функции мобильного телефона","secondAnswer": "Делать сайты комфортными для людей с ограниченными возможностями","sphere":["mob","front"]},
    {"firstAnswer": "Работать над программированием новых фишек мобильного приложения", "secondAnswer": "Придумывать программы, которые автоматически ищут ошибки", "sphere":["mob","qa"]},
    {"firstAnswer":"Внедрять в мобильное приложение аналитику поведения пользователя", "secondAnswer": "Уметь одинаково хорошо и настраивать операционные системы, и программировать сайты","sphere":["mob","full"]},
    {"firstAnswer": "Создавать на сайте интересные эффекты и анимации", "secondAnswer":"Педантично, шаг за шагом, проверять правильность работы каждой детали","sphere":["front","qa"]},
    {"firstAnswer": "Программировать различные детали сайта - кнопки, прогресс-бары и др.", "secondAnswer":"Анализировать разнородные данные и собирать их в единое целое","sphere":["front","full"]},
    {"firstAnswer": "Находить даже минимальные расхождения между тем, как должна работать программа, и тем, как она работает сейчас", "secondAnswer": "Разбираться во всех областях программирования, пусть даже и поверхностно","sphere":["qa","full"]}
],"QA":"QA-Инженер или тестировщик – это специалист, который отвечает за качество и безошибочную работу продукта. Он тестирует продукт, ищет возможные ошибки и исправляет их. Тестировщики часто проверяют не только правильность работы продукта, но и работу программистов, поэтому иногда просматривают их код. Очень привлекательной эта профессия стала из-за того, что на начальных этапах профессия не всегда требует знаний языков программирования, обширного технического бэкграунда, глубокого понимания современных технологий и т.д.", "QASecondParagraph": "Поэтому начать IT карьеру с тестировщика – это наиболее частый и простой выбор IT новичков или людей, которые переучиваются со своей текущей специальности на IT", 
"FRONTEND": "Frontend-разработчик – программист, создающий внешний пользовательский функционал web-сайта и отвечающий за его соответствие макету дизайна и за единообразное отображение страниц в любом браузере. Это специалист, от которого зависит, насколько удобным и функциональным будет интерфейс сайта или приложения. ", "FRONTENDSecondParagraph": "В некоторых случаях, если макет не отражает деталей концепта, Frontend-разработчик может проявлять себя в качестве дизайнера, когда от сотрудника требуется верстка уже готового макета (с помощью связки HTML+CSS).",
 "FULLSTACK":"Fullstack веб-разработчик – это программист, который способен принимать активное участие во всех этапах разработки: начиная с разработки серверной логики будущего приложения и заканчивая клиентским кодом, работающим в браузере. Наиболее ценно в таком специалисте умение планировать структуру приложения, представлять, как все его части будут взаимодействовать друг с другом и с внешними компонентами.", "FULLSTACKSecondParagraph": "Первостепенная задача – обеспечить создание правильного скелета приложения, который в дальнейшем выдержит нарастающую нагрузку в виде новых фич и компонентов. Fullstack-разработчик может самостоятельно сделать свое приложение “под ключ”", 
 "MOBILE": "Мобильный разработчик — это специалист, разрабатывающий программные приложения для различных мобильных устройств: планшетов, смартфонов. Сейчас эта профессия очень популярная, перспективная и востребованная. Ведь именно в сфере мобильной разработки появились такие интересные новинки как голосовой и жестовый интерфейс.",
 "QAlinks":["https://netology.ru/programs/qa"], "FRONTENDlinks":["https://netology.ru/programs/front-end"], "FULLSTACKlinks": ["https://netology.ru/programs/web-developer","https://netology.ru/programs/python","https://netology.ru/programs/godeveloper"], "MOBILElinks":["https://netology.ru/programs/android-app","https://netology.ru/programs/ios-developer"], "QAnames": ["Тестировщик"], "FRONTENDnames":["Frontend-разработчик с нуля"], "FULLSTACKnames":["Веб-разработчик с нуля","Python-разработчик","Golang-разработчик с нуля","Django: создание функциональных веб-приложений"], "MOBILEnames":["Android-разработчик","iOS-разработчик с нуля"],
 "QADisplayName": "Тестировщик", "FRONTENDDisplayName": "Frontend-разработчик", "FULLSTACKDisplayName": "Fullstack-разработчик","MOBILEDisplayName": "Мобильный разработчик" 
}